app/Controllers/AuthController.php

    public function doLogin()
    {
        $validation = \Config\Services::validation();

        $validation->setRules([
            'username' => 'required',
            'password' => 'required'
        ]);

        if (!$validation->withRequest($this->request)->run()) {
            return redirect()
                ->back()
                ->withInput()
                ->with('validation', $validation);
        }

        // Validation passed — proceed with authentication
        $username = $this->request->getPost('username');
        $password = $this->request->getPost('password');

        // First check in admin table
        $model = new AdminUserModel();
        $user = $model->where('username', $username)->first();
---
SELECT *
FROM `admin_users`
WHERE `username` = 'Jeremiah Perez'
 LIMIT 1

        } else {
            // Now check in users table
            $model = new UserModel();
            $user = $model->where('username', $username)->first();
---
SELECT *
FROM `user`
WHERE `username` = 'Jeremiah Perez'
 LIMIT 1