app/Controllers/ProductController.php

    public function index()
    {
        $model = new ProductModel();
        $data['products'] = $model->findAll();
---
SELECT *
FROM `products`

    public function create()
    {
        $model = new ProductModel();

        // Handle file upload
        $img = $this->request->getFile('image');
        $imgName = '';
        if ($img->isValid() && !$img->hasMoved()) {
            if ($img->getMimeType() == 'image/jpeg' ||
                $img->getMimeType() == 'image/png') {

                $imgName = $img->getRandomName();
                $img->move(FCPATH . 'public/uploads/products/', $imgName);
            } else {
                return redirect()->back()->with('msg', 'Invalid image format.');
            }
        }

        $data = [
            'name'  => $this->request->getPost('name'),
            'brand' => $this->request->getPost('brand'),
            'price' => $this->request->getPost('price'),
            'stock' => $this->request->getPost('stock'),
            'image' => $imgName
        ];

        $model->insert($data);
---
INSERT INTO `products` (`name`, `brand`, `price`, `stock`, `image`) VALUES ('D', 'D', '12', '12', '1750220561_c8c722447b9f2ddf3440.jpg')

    public function delete($id)
    {
        $model = new ProductModel();
        $model->delete($id);
---
DELETE FROM `products`
WHERE `id` IN ('29')