app/Controllers/ShoesController.php

SELECT *
FROM `products`
---
    public function index()
    {
        $model = new ProductModel();
        $data['products'] = $model->findAll();

SELECT *
FROM `products`
WHERE `products`.`id` = '16'
---
    public function buy($id)
    {
        $model = new ProductModel();
        $product = $model->find($id);